Improving the architecture docs
